src/cf/InformationRegisters/ОчередьИсходящихСообщений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОчередьИсходящихСообщений</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Хранилище</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусСообщения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/cf/Enums/СтатусСообщения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусСообщения</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Новое</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Обработано</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/InformationRegisters/ОчередьИсходящихСообщений/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс 

Процедура ДобавитьСообщение(СсылкаОбъекта) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОчередьИсходящихСообщений.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Идентификатор = Новый УникальныйИдентификатор();
	МенеджерЗаписи.Статус = Перечисления.СтатусСообщения.Новое; 
	МенеджерЗаписи.Дата = СсылкаОбъекта.Дата;
	МенеджерЗаписи.Хранилище = СериализованныйОбъект(СсылкаОбъекта); 
	МенеджерЗаписи.Записать();
	
КонецПроцедуры	

Процедура УстановитьСтатусОбработан(Идентификатор) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.ОчередьИсходящихСообщений.СоздатьНаборЗаписей();
	МенеджерЗаписи.Отбор.Идентификатор.Установить(Идентификатор);
	МенеджерЗаписи.Прочитать();  
	
	Если МенеджерЗаписи.Количество() Тогда
		Запись = МенеджерЗаписи.Получить(0);	
		Запись.Статус = Перечисления.СтатусСообщения.Обработано; 
		МенеджерЗаписи.Записать(); 
	КонецЕсли;
	
КонецПроцедуры	

Функция ВыборкаНовыхСообщений() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ОчередьИсходящихСообщений.Идентификатор КАК Идентификатор,
	|	ОчередьИсходящихСообщений.Хранилище КАК Хранилище
	|ИЗ
	|	РегистрСведений.ОчередьИсходящихСообщений КАК ОчередьИсходящихСообщений
	|ГДЕ
	|	ОчередьИсходящихСообщений.Статус = &Статус";
	
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусСообщения.Новое);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Возврат  ВыборкаДетальныеЗаписи;
	
КонецФункции

#КонецОбласти 

#Область СлужебныеПроцедурыИФункции

Функция СериализованныйОбъект(СсылкаОбъекта)
	
	ЗаписьJSON = Новый ЗаписьJSON;
	ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб); 
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON); 
	СериализаторXDTO.ЗаписатьJSON(ЗаписьJSON,СсылкаОбъекта.ПолучитьОбъект(),НазначениеТипаXML.Явное);
	СтрокаJSON = ЗаписьJSON.Закрыть();

	Возврат СтрокаJSON;
	
КонецФункции 

#КонецОбласти
